In [1]:
f = lambda x: x**2
[f(x) for x in range(10)]

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [2]:
[(lambda x: x**2)(x) for x in range(10)]

[0, 1, 4, 9, 16, 25, 36, 49, 64, 81]

In [4]:
sqr = lambda x: x**2
lst = [18, 19, 25, 31]
result = map(sqr, lst)
print(list(result))

[324, 361, 625, 961]

In [5]:
import pandas as pd

In [25]:
data = [['tom', 10], ['nick', 15], ['juli', 14]]
  
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age'])

df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [28]:
df['AgeSq'] = df.apply(lambda x: x['Age']**2, axis=1)

In [31]:
def IV(Age):
    return Age**2

df['AgeSq2'] = df.apply(lambda x: IV(x['Age']),axis=1)

In [32]:
df

   Name  Age  AgeSq  AgeSq2
0   tom   10    100     100
1  nick   15    225     225
2  juli   14    196     196